[
  {
    "id": 1,
    "name": "Bible Project",
    "slug": "bible-project",
    "tagline": "We Help People Experience the Bible as a Unified Story That Leads to Jesus",
    "imageUrl": "/images/bibleproject-logo.png",
    "website": "https://bibleproject.com",
    "jobUrl": "https://bibleproject.com/jobs/frontend-engineer/",
    "description": "Bible Project is a Christian organization based in SE Portland, Oregon, known for creating free, high-quality Bible resources. Their mission is to help people experience the Bible as a unified story that leads to Jesus.",
    "jobAppeal": "Bible Project is a Christian organization based out of SE Portland, Oregon. Bible Project is remote-friendly, offers very generous benefits, and provides stipends for professional development. The main appeal for me is that I am someone who has benefitted form the Bible Projects free content. I would love to be a part of the team that makes what they do possible. I really appreciate the company culture. At Bible Project they actively try to foster connection among their employees through their virtual interest groups. They also have a 100% compensation rate for parental, caregiver, and medical leave. They really seem to care about their employees wellness, since they even schedule a four week rest period each year.",
    "location": "Portland, OR (Hybrid)",
    "workStyle": "Hybrid",
    "requiredSkills": [
      "JavaScript",
      "HTML",
      "CSS"
    ],
    "stackFit": "The role aligns well with my current skills in JavaScript, HTML, and CSS. React and server-side knowledge are a plus, so I could contribute immediately without needing to acquire major new skills.",
    "goalsInPosition": [
      "Contribute to the Classroom platform used by learners around the world",
      "Grow under mentorship from experienced engineers and strengthen best practices",
      "Be part of a mission-driven team that makes impactful content accessible for free"
    ],
    "currentSkillMatch": {
      "have": [
        "JavaScript",
        "HTML",
        "CSS",
        "React"
      ],
      "needToLearn": []
    },
    "relatedPosition": {
      "title": "Frontend Engineer",
      "description": "Craft high-quality, tested web code for the Classroom platform using React and Remix; collaborate with teams and contribute to user-facing features.",
      "link": "https://bibleproject.com/jobs/frontend-engineer/"
    }
  },
  {
    "id": 2,
    "name": "Life.Church / Youversion",
    "slug": "life-church-youversion",
    "tagline": "Our mission is to encourage and challenge people to seek intimacy with God every day.",
    "imageUrl": "/images/YouVersion_logo.png",
    "website": "https://www.life.church/careers/youversion/",
    "jobUrl": "https://jobs.lever.co/life/edd2d1c9-c26c-4079-aed5-1c893080ecc8",
    "description": "YouVersion is the digital ministry of Life.Church, headquartered in Edmond, Oklahoma. They develop the YouVersion Bible App, used daily by millions of people worldwide.",
    "jobAppeal": "Youversion is the digital ministry of Life.Church in Edmond, Oklahoma. I use the Youversion Bible app daily and believe in Life.Church’s mission to lead people to become fully devoted followers of Christ. They provide competitive benefits, resources for health and wellness, life insurance, generous 401k retirement plan, and stipends for professional development.",
    "location": "Edmond, OK",
    "workStyle": "Hybrid",
    "requiredSkills": [
      "JavaScript",
      "TypeScript",
      "Tailwind CSS",
      "NextJS",
      "Cloud Technologies"
    ],
    "stackFit": "I already know JavaScript, TypeScript, Tailwind CSS, and NextJS. I would need to learn more about their cloud technologies, including Flywheel and Docker.",
    "goalsInPosition": [
      "Work on maintenance and new features for the YouVersion Bible App",
      "Learn mobile technologies like React Native, Java, Kotlin, Swift, and Objective-C",
      "Grow into a Senior Engineer role"
    ],
    "currentSkillMatch": {
      "have": [
        "JavaScript",
        "TypeScript",
        "Tailwind CSS",
        "NextJS"
      ],
      "needToLearn": [
        "Cloud technologies",
        "React Native",
        "Java",
        "Kotlin",
        "Swift",
        "Objective-C"
      ]
    },
    "relatedPosition": {
      "title": "Senior Software Engineer",
      "description": "Develop and maintain software for YouVersion using modern technologies, review code, mentor other engineers, and plan future developments.",
      "link": "https://jobs.lever.co/life/edd2d1c9-c26c-4079-aed5-1c893080ecc8"
    }
  },
  {
    "id": 3,
    "name": "Overflow",
    "slug": "overflow",
    "tagline": "Making generosity frictionless through innovative technology",
    "imageUrl": "/images/overflow-logo.svg",
    "website": "https://www.overflow.co/",
    "jobUrl": "https://www.christiantechjobs.io/christian-jobs/sr-software-engineer-overflow-757",
    "description": "Overflow is a philanthropy platform based in Mountain View, CA, focused on making generosity frictionless for nonprofits, churches, and charities.",
    "jobAppeal": "Overflow is a philanthropy platform located in Moutain View, CA about 22 minutes from Menlo Park where my Fiancee works. I want to work here mainly because of what a good fit seems to be. It uses most of the tech stack I learned from CodeStack Academy, and I admire Overflow’s mission to make generosity frictionless. It offers good benefits, company paid holidays, dependent care spending accounts, paid parental leave, a 401k, a mental health stipend, and even the Disney Park Experience!",
    "location": "Mountain View, CA",
    "workStyle": "Hybrid",
    "requiredSkills": [
      "TypeScript",
      "React",
      "NextJS",
      "NodeJS",
      "Express",
      "JavaScript Frameworks"
    ],
    "stackFit": "This role fits my current knowledge of the stack I learned from CodeStack Academy. I would need to learn GitLab, MongoDB, and AWS.",
    "goalsInPosition": [
      "Learn to use GitLab, MongoDB, and Amazon Web Services",
      "Grow into a Senior Engineer role and contribute to Overflow’s mission"
    ],
    "currentSkillMatch": {
      "have": [
        "TypeScript",
        "React",
        "NextJS",
        "NodeJS",
        "Express"
      ],
      "needToLearn": [
        "GitLab",
        "MongoDB",
        "Amazon Web Services"
      ]
    },
    "relatedPosition": {
      "title": "Senior Software Engineer",
      "description": "Design APIs, build infrastructure for donation management, implement security and observability, and work with nonprofits to enhance Overflow's platform.",
      "link": "https://www.christiantechjobs.io/christian-jobs/sr-software-engineer-overflow-757"
    }
  }
  ,
  {
    "id": 4,
    "name": "Department of State Hospitals (California)",
    "slug": "department-of-state-hospitals",
    "tagline": "Delivering behavioral healthcare through stable and secure government employment",
    "imageUrl": "/images/DSH-logo.png",
    "website": "https://www.dsh.ca.gov/About_Us/index_en.html",
    "jobUrl": "https://calcareers.ca.gov/CalHrPublic/Jobs/JobPosting.aspx?JobControlId=473072",
    "description": "The Department of State Hospitals (DSH), based in Sacramento, CA, treats and evaluates the behavioral health needs of patients mandated for treatment by court order. It offers long-term opportunities and job stability through California state government employment.",
    "jobAppeal": "I would like to work for the Department of State Hospitals because of the stability and long term opportunities working for the California State government. Located in the at our state capital, Sacramento, California, the Department of State Hospitals mostly treats and evaluates the behavioral health needs of patients mandated for treatment by a criminal or civil court judge.",
    "location": "Sacramento, CA",
    "workStyle": "On-site",
    "requiredSkills": ["C#", ".NET", "JavaScript", "HTML5", "SQL"],
    "stackFit": "There is some overlap with my current stack. I would need to learn Azure DevOps and ServiceNow to be fully integrated with the team.",
    "goalsInPosition": [
      "Gain experience working for the California state government",
      "Transition into roles at other departments within the state system",
      "Familiarize myself with the tech stacks commonly used in government projects"
    ],
    "currentSkillMatch": {
      "have": ["JavaScript", "HTML5", "SQL", "C#", ".NET"],
      "needToLearn": ["Azure DevOps", "ServiceNow"]
    },
    "relatedPosition": {
      "title": "Software Developer",
      "description": "Support system integrations, full-stack applications, and ServiceNow development using technologies such as C#, .NET, and Azure DevOps in a collaborative environment.",
      "link": "https://calcareers.ca.gov/CalHrPublic/Jobs/JobPosting.aspx?JobControlId=473072"
    }
  },
  {
    "id": 5,
    "name": "Angel Studios",
    "slug": "angel-studios",
    "tagline": "Where viewers decide what stories get told",
    "imageUrl": "/images/Angel-logo.png",
    "website": "https://www.angel.com/about",
    "jobUrl": "https://www.christiantechjobs.io/christian-jobs/sr-full-stack-engineer-martech-angel-studios-496",
    "description": "Angel Studios is a streaming platform where the audience gets to choose and support the content they want to see. Their unique, viewer-driven model helps launch projects through crowdfunding and community voting.",
    "jobAppeal": "As an avid consumer of media, I think working for Angel Studios would be very cool. I really like their approach to content creation, where it is highly viewer and investor driven. Viewers can sign up for Angel Studio’s guild service and vote on project ideas that could end up getting theatrical or streaming releases. Angel Studios offers great benefits including medical, dental, and vision for employees and their dependents. They offer a 401k with employer matching, a health savings account, stock options, life insurance, pet insurance, and identity theft insurance.",
    "location": "Provo, UT",
    "workStyle": "Hybrid",
    "requiredSkills": [
      "JavaScript",
      "React",
      "NodeJS",
      "PostgreSQL",
      "SQL",
      "APIs",
      "MarTech"
    ],
    "stackFit": "Unfortunately there is limited overlap between the Angel Studios tech stack and my current stack. While I know Javascript, React, some SQL, and APIs, I would have to learn NodeJs, PostgreSQL, and MarTech softwares.",
    "goalsInPosition": [
      "Familiarize myself with MarTech softwares",
      "Learn more about backend technologies for streaming platforms"
    ],
    "currentSkillMatch": {
      "have": ["JavaScript", "React", "SQL", "APIs"],
      "needToLearn": ["NodeJS", "PostgreSQL", "MarTech softwares"]
    },
    "relatedPosition": {
      "title": "Senior Full Stack Engineer (MarTech)",
      "description": "Implement and manage MarTech stack components, improve application performance, ensure tracking accuracy across marketing platforms, and maintain scalable code.",
      "link": "https://www.christiantechjobs.io/christian-jobs/sr-full-stack-engineer-martech-angel-studios-496"
    }
  }  
]